test/site/content-org/all-posts.org
#+hugo_base_dir: ../

#+seq_todo: TODO DRAFT DONE
#+seq_todo: TEST__TODO | TEST__DONE

#+property: header-args :eval never-export

#+startup: indent

#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]

# https://scripter.co/latex-in-html/
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@
#+macro: youtube @@html:<div class="org-youtube"><iframe src="https://www.youtube-nocookie.com/embed/$1" allowfullscreen title="YouTube Video"></iframe></div>@@

#+bibliography: cite/bib/orgcite.bib

#+author:

*** Invalid Nocites                                          :invalid:nocite:
:PROPERTIES:
:EXPORT_FILE_NAME: invalid-nocites
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :nocite '(@foo @bar)
:END:
This post has citations ~@foo~ and ~@bar~ listed in ~nocite~
meta-data. But they are invalid as they don't exist in any of the
bibliography files.

But that generates neither a Pandoc warning nor error.

As the final Pandoc output Markdown ends up with *no* references, the
Pandoc output is discarded, and the original ~ox-hugo~ output is used
instead.
